# InvalidBaseConstraintForLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..InvalidBaseConstraintForLevel Property
BuiltInFailures..::..WallFailures Class See Also
---
Base Constraint is invalid for the Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidBaseConstraintForLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidBaseConstraintForLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidBaseConstraintForLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace